tests/performance_tests/artillery.yml
config:
  target: 'http://localhost:3000'  # Replace with your server URL
  phases:
    - duration: 30
      arrivalRate: 2
    - duration: 60
      arrivalRate: 5
    - duration: 30
      arrivalRate: 3
  defaults:
    headers:
      'Content-Type': 'application/json'
      'Cookie': 'connect.sid=your-session-cookie-here'  # You'll need a valid session

scenarios:
  - name: "Health Check Test"
    weight: 30
    flow:
      - get:
          url: "/dashboard/admin/health"
          expect:
            - statusCode: [200, 401, 403]
      - think: 2

  - name: "Basic Dashboard Performance Test"
    weight: 50
    flow:
      - get:
          url: "/dashboard/admin/usercount"
          expect:
            - statusCode: [200, 202, 401, 403]
      - think: 3
      - get:
          url: "/dashboard/admin/orders"
          expect:
            - statusCode: [200, 202, 401, 403]
      - think: 2

  - name: "Light Cache Performance Test"
    weight: 20
    flow:
      - get:
          url: "/dashboard/admin/health"
          expect:
            - statusCode: [200, 401, 403]
      - think: 1
      - get:
          url: "/dashboard/admin/health"
          expect:
            - statusCode: [200, 401, 403]